
# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n-cbam summary: 249 layers,  3243958 parameters,  3243942 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s-cbam summary: 249 layers, 11511814 parameters, 11511798 gradients,  29.1 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m-cbam summary: 319 layers, 26420182 parameters, 26420166 gradients,  79.7 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l-cbam summary: 389 layers, 44282918 parameters, 44282902 gradients, 166.2 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x-cbam summary: 389 layers, 69153142 parameters, 69153126 gradients, 259.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C3Ghost, [128, True]]    # 2
  - [-1, 1, GhostConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C3Ghost, [256, True]]    # 4
  - [-1, 1, GhostConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C3Ghost, [512, True]]    # 6
  - [-1, 1, GhostConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C3Ghost, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4   # 11
  - [-1, 3, C3Ghost, [512, False]]  # 12
  - [-1, 1, CBAM, [7]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 4], 1, Concat, [1]]  # 15
  - [-1, 3, C3Ghost, [256, False]]  # 16
  - [-1, 1, CBAM, [7]]  # 16 (P3/8-small)  # 17

  - [-1, 1, GhostConv, [256, 3, 2]]  # 18
  - [[-1, 12], 1, Concat, [1]]  # 19
  - [-1, 3, C3Ghost, [512, False]]  # 20
  - [-1, 1, CBAM, [7]]  # 21

  - [-1, 1, GhostConv, [512, 3, 2]]   # 22
  - [[-1, 9], 1, Concat, [1]]  # 23
  - [-1, 3, C3Ghost, [1024, False]]  # 24
  - [-1, 1, CBAM, [7]]  # 24 (P5/32-large)  # 25

  - [[17, 21, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
